app/controllers/blocks_controller.rb

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
---
  def show
    @block = Block.find(params[:id])

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
---
  def edit
    @block = Block.find(params[:id])

INSERT INTO `blocks` (`name`, `created_at`, `updated_at`) VALUES('Scars of Mirrodin', '2011-05-21 17:00:14', '2011-05-21 17:00:14')
---
  def create
    @block = Block.new(params[:block])

    respond_to do |format|
      if @block.save

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
UPDATE `blocks` SET `updated_at` = '2011-05-21 18:09:07', `name` = 'Scars of Mirrodin' WHERE `id` = 1
---
  def update
    @block = Block.find(params[:id])

    respond_to do |format|
      if @block.update_attributes(params[:block])