app/controllers/cards_controller.rb

SELECT * FROM `cards` WHERE (`cards`.`id` = 0)
---
  def show
    @card = Card.find(params[:id])

SELECT * FROM `cards` WHERE (`cards`.`id` = 1)
---
  def edit
    @card = Card.find(params[:id])

INSERT INTO `cards` (`spanish_name`, `created_at`, `updated_at`, `english_name`) VALUES('Cobra capucha mortal', '2011-05-22 11:32:19', '2011-05-22 11:32:19', '')
---
  def create
    @card = Card.new(params[:card])

    respond_to do |format|
      if @card.save