app/controllers/expansions_controller.rb

SELECT * FROM `expansions` WHERE (`expansions`.`id` = 1)
---
  def show
    @expansion = Expansion.find(params[:id])

INSERT INTO `expansions` (`name`, `created_at`, `updated_at`, `block_id`) VALUES('Scars of Mirrodin', '2011-05-21 17:24:35', '2011-05-21 17:24:35', 1)
---
  def create
    @expansion = Expansion.new(params[:expansion])

    respond_to do |format|
      if @expansion.save