app/controllers/expansion_of_cards_controller.rb

  def index
    @expansion_of_cards = ExpansionOfCard.find(:all)
---
SELECT * FROM `cards` WHERE (`cards`.`id` IN ('--- :id\n',1))

  def show
    @expansion_of_card = ExpansionOfCard.find(params[:id])
---
SELECT * FROM `expansion_of_cards` WHERE (`expansion_of_cards`.`id` = 1)

  def create
    @expansion_of_card = ExpansionOfCard.new(params[:expansion_of_card])

    respond_to do |format|
      if @expansion_of_card.save
---
INSERT INTO `expansion_of_cards` (`created_at`, `card_id`, `updated_at`, `expansion_id`) VALUES('2011-05-21 20:10:14', 1, '2011-05-21 20:10:14', 1)