app/controllers/home_controller.rb

  def index
	@cards = Card.find(:all, :include => :inventory)
---
SELECT `inventories`.* FROM `inventories` WHERE (`inventories`.card_id IN (1,2))