app/controllers/inventories_controller.rb

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 1)
---
  def show
    @inventory = Inventory.find(params[:id])

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 1)
---
  def edit
    @inventory = Inventory.find(params[:id])

INSERT INTO `inventories` (`created_at`, `card_id`, `updated_at`, `copies`) VALUES('2011-05-21 17:16:09', 2, '2011-05-21 17:16:09', 0)
---
  def create
    @inventory = Inventory.new(params[:inventory])

    respond_to do |format|
      if @inventory.save

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 1)
UPDATE `inventories` SET `updated_at` = '2011-05-21 10:48:45', `copies` = 3 WHERE `id` = 1
---
  def update
    @inventory = Inventory.find(params[:id])

    respond_to do |format|
      if @inventory.update_attributes(params[:inventory])

SELECT * FROM `inventories` WHERE (`inventories`.`id` = 2)
DELETE FROM `inventories` WHERE `id` = 2
---
  def destroy
    @inventory = Inventory.find(params[:id])
    @inventory.destroy